{
  "AADSTS50058": "Session information is not sufficient for single-sign-on.",
  "AADSTS50105": "Your administrator has configured the application {appName} ('{appId}') to block users unless they are specifically granted ('assigned') access to the application.  The signed in user '{user}' is blocked because they are not a direct member of a group with access, nor had access directly assigned by an administrator. Please contact your administrator to assign access to this application.",
  "AADSTS700016": "Application with identifier '{appIdentifier}' was not found in the directory '{tenantName}'. This can happen if the application has not been installed by the administrator of the tenant or consented to by any user in the tenant. You may have sent your authentication request to the wrong tenant.",
  "AADSTS90002": "Tenant '{tenant_name}' not found. Check to make sure you have the correct tenant ID and are signing into the correct cloud. Check with your subscription administrator, this may happen if there are no active subscriptions for the tenant.",
  "AADSTS65001": "The user or administrator has not consented to use the application with ID '{identifier}'{namePhrase}. Send an interactive authorization request for this user and resource.",
  "AADSTS53003": "Access has been blocked by Conditional Access policies. The access policy does not allow token issuance.",
  "AADSTS16003": "The user account does not exist in the directory or the user hasn't been explicitly added to the tenant. To sign into this application, the account must be added to the directory.",
  "AADSTS26000": "The provided access grant requires interaction.",
  "AADSTS29200": "QR Code requested. Generate QR code and display on UX page for interactive sign-ins.",
  "AADSTS29201": "Invalid QR Code request. Client Id ({clientId}) or target client Id ({targetClientId}) is invalid.",
  "AADSTS29202": "Invalid scope and response_type request parameters. scope=qrcode can only be used with response_type=none.",
  "AADSTS29203": "Invalid target_client_id '{targetClientId}' argument value.",
  "AADSTS29204": "Failed to write QR Code token to Store.",
  "AADSTS29205": "Generated QR Code string has exceeded maximum supported length.",
  "AADSTS29206": "Invalid QR Code redemption request. Client Id ({clientId}) is invalid.",
  "AADSTS29207": "Error processing session data. QR Code is either invalid or expired.",
  "AADSTS29208": "Error processing session data. QR Code was already redeemed.",
  "AADSTS29210": "QR Code sign-in is disabled via user credential policy.",
  "AADSTS29211": "QR Code sign-in is not supported for passthrough users.",
  "AADSTS29212": "QR Code sign-in is not supported for consumer user scenarios.",
  "AADSTS40002": "The identity provider returned an error. The status returned was '{status}' and the message was '{message}'.",
  "AADSTS40003": "A required token was not emitted by an external Identity Provider.",
  "AADSTS40004": "A required token was not emitted by an external Identity Provider.",
  "AADSTS40005": "Invalid token received from external Identity Provider. Current time: {curTime}, expiry time of assertion {expTime}.",
  "AADSTS40008": "There was an unexpected error from the external identity provider.",
  "AADSTS40009": "The identity provider returned an error.",
  "AADSTS40010": "The identity provider has failed with a transient error.",
  "AADSTS40013": "Social IDP MicroService Federation disabled.",
  "AADSTS40014": "Federated Identity Provider is unavailable.",
  "AADSTS40015": "The identity provider returned an error.",
  "AADSTS40016": "The Identity Provider returned an error.",
  "AADSTS50000": "There was an error issuing a token or an issue with our sign-in service.",
  "AADSTS50001": "The resource is disabled or the resource named could not be found. This can happen if the application has not been installed by the administrator of the tenant, or if the resource principal was not found in the directory or is invalid due to a typo.",
  "AADSTS50002": "This tenant isn't supported for this authentication method yet.",
  "AADSTS50003": "Certificate roll is in progress. Please retry the operation later.",
  "AADSTS50004": "A transient error has occurred. Please try again.",
  "AADSTS50005": "User tried to log in to a device from a platform ({platform}) that's currently not supported through Conditional Access policy. Supported device platforms are: iOS, Android, Mac, and Windows flavors.",
  "AADSTS50006": "Signature verification failed because of an invalid signature.",
  "AADSTS50007": "Encryption certificate was not found in the directory.",
  "AADSTS50008": "The SAML token is invalid.",
  "AADSTS50010": "Audience URI validation failed since no token audiences were configured.",
  "AADSTS50011": "The {redirectTerm} '{replyAddress}' specified in the request does not match the {redirectTerm}s configured for the application '{identifier}'. Make sure the {redirectTerm} sent in the request matches one added to your application in the Azure portal. Navigate to {akamsLink} to learn more about how to fix this. {detail}",
  "AADSTS50012": "Authentication failed.",
  "AADSTS50013": "Assertion failed signature validation. Possibly because the token issuer doesn't match the API version within its valid time range, it's expired or malformed, or the refresh token in the assertion is not a primary refresh token.",
  "AADSTS50014": "The user's redemption is in a pending state. The guest user account is not fully created yet.",
  "AADSTS50015": "The user requires legal age group consent.",
  "AADSTS50016": "Invalid Argument Redirect ErrorCode value.",
  "AADSTS50017": "Validation of given certificate for certificate based authentication failed.",
  "AADSTS50019": "This occurred due to an interrupt to select a certificate before the user signs in.",
  "AADSTS50020": "User account '{email}' from identity provider '{idp}' does not exist in tenant '{tenant}' and cannot access the application '{appId}'({appName}) in that tenant. The account needs to be added as an external user in the tenant first. Sign out and sign in again with a different Azure Active Directory user account.",
  "AADSTS50023": "ClaimType '{claimType}' is reserved for system use.",
  "AADSTS50024": "Unable to decrypt client state.",
  "AADSTS50025": "The issuer name must be specified.",
  "AADSTS50026": "The mail is too long, maximum length is {length}.",
  "AADSTS50027": "JWT token is invalid or malformed.",
  "AADSTS50029": "The reply URI specified in the request contains invalid characters. Domain names of this form are not supported.",
  "AADSTS50030": "Either forwardableOnBehalfOfOriginsAcceptedAudiencesList or ForwardableOnBehalfOfOriginsAcceptedPrecedingAppsList property in the first party app registration is not set. Both fields need to be filled on first party app portal for PFT OBO to be successful.",
  "AADSTS50032": "RSA key size {actualSize} is less than the minimum required {minSize} bits.",
  "AADSTS50033": "A transient error has occurred. Please try again.",
  "AADSTS50034": "The user account {identifier} does not exist in the {tenant} directory. To sign into this application, the account must be added to the directory.",
  "AADSTS50035": "ECC key size {actualSize} is less than the minimum required {minSize} bits.",
  "AADSTS50038": "The API version isn't supported.",
  "AADSTS50042": "The salt required to generate a pairwise identifier is missing in the principal.",
  "AADSTS50043": "Unable to generate a pairwise identifier with more than one salt in principal.",
  "AADSTS50045": "The salt required to generate a pairwise identifier is malformed in principal.",
  "AADSTS50048": "Subject must match the issuer claim in the client assertion.",
  "AADSTS50049": "Unknown or invalid instance.",
  "AADSTS50050": "The request is malformed: invalid format for '{name}' value.",
  "AADSTS50051": "The root key endpoint is missing the root keys.",
  "AADSTS50052": "The password entered exceeds the maximum length. Please reach out to your admin to reset the password.",
  "AADSTS50053": "The account is locked, you've tried to sign in too many times with an incorrect user ID or password.",
  "AADSTS50054": "Looks like you entered your old password. Try again with your new one.",
  "AADSTS50055": "The password is expired.",
  "AADSTS50056": "Invalid or missing password: password does not exist in the directory for this user.",
  "AADSTS50057": "The user account is disabled.",
  "AADSTS50059": "No tenant-identifying information found in either the request or implied by any provided credentials.",
  "AADSTS50060": "Unable to sign out.",
  "AADSTS50061": "Unable to complete signout. The request was invalid.",
  "AADSTS50062": "Signout request is unauthorized.",
  "AADSTS50068": "Signout failed. The initiating application is not a participant in the current session.",
  "AADSTS50069": "Signout failed. The request specified a name identifier of '{identifier}' which did not match the existing session(s).",
  "AADSTS50070": "Signout failed. The request specified session indexes '{identifier}' which did not match the existing session(s).",
  "AADSTS50071": "Signout request has expired.",
  "AADSTS50072": "Due to a configuration change made by your administrator, or because you moved to a new location, you must enroll in multi-factor authentication to access '{identifier}'.",
  "AADSTS50074": "Strong Authentication is required.",
  "AADSTS50075": "The tenant '{tenant}' does not have security defaults enabled.",
  "AADSTS50076": "Due to a configuration change made by your administrator, or because you moved to a new location, you must use multi-factor authentication to access '{resource}'.",
  "AADSTS50077": "The administrator created a conditional access policy that requires the authenticator to be used to provide GPS location.",
  "AADSTS50078": "Presented multi-factor authentication has expired due to policies configured by your administrator, you must refresh your multi-factor authentication to access '{resource}'.",
  "AADSTS50079": "Due to a configuration change made by your administrator, or because you moved to a new location, you must enroll in multi-factor authentication to access '{identifier}'.",
  "AADSTS50080": "Bad request received.",
  "AADSTS50081": "The administrator created a conditional access policy that requires GPS location.",
  "AADSTS50082": "The partitioned token signing key endpoint is missing the partitioned token signing keys.",
  "AADSTS50085": "Refresh token needs a social identity provider login.",
  "AADSTS50087": "A transient error has occurred during strong authentication. Please try again.",
  "AADSTS50088": "Limit on telecom MFA calls reached. Please try again in a few minutes.",
  "AADSTS50089": "Authentication failed due to flow token expired.",
  "AADSTS50091": "Passed query string length exceeds supported limit.",
  "AADSTS50093": "Missing value for the SAML NameID.",
  "AADSTS50094": "Unknown source configured on the audience for the SAML NameID.",
  "AADSTS50095": "Unknown source configured on the audience for the SAML email claim.",
  "AADSTS50096": "Source configured on the audience for the SAML NameID is not compatible with the requested format.",
  "AADSTS50097": "Device authentication is required.",
  "AADSTS50098": "JWT body must contain '{field}'.",
  "AADSTS50099": "Invalid nonce.",
  "AADSTS50100": "There was an error transforming the claims for the token.",
  "AADSTS50101": "Unknown claims transformer '{name}' was specified for principal '{principalId}'.",
  "AADSTS50102": "Unable to load CustomClaimsTransformer '{type}' was specified for principal '{principalId}'.",
  "AADSTS50103": "There was an error transforming the claims for the token: {errorMessage}",
  "AADSTS50107": "The requested federation realm object '{name}' does not exist.",
  "AADSTS50120": "Unknown credential type, issue with the JWT header.",
  "AADSTS50123": "Unknown claims transformation method '{method}' was specified for principal '{principalId}'.",
  "AADSTS50124": "Invalid regular expression configured for claims transformation for this application.",
  "AADSTS50125": "Sign-in was interrupted due to a password reset or password registration entry.",
  "AADSTS50126": "Error validating credentials due to invalid username or password.",
  "AADSTS50127": "Client app is a MAM app and device is not registered.",
  "AADSTS50128": "No tenant-identifying information found in either the request or implied by any provided credentials.",
  "AADSTS50129": "The device is not workplace joined. Workplace join is required to register the device.",
  "AADSTS50130": "The claim value(s) '{value}' cannot be interpreted as known auth method(s).",
  "AADSTS50131": "Device is not in required device state: {state}. Or, the request was blocked due to suspicious activity, access policy, or security policy decisions.",
  "AADSTS50132": "The session is not valid due the following reasons: password expiration or recent password change, SSO Artifact is invalid or expired, session is not fresh enough for application, or a silent sign-in request was sent but the user's session with Azure AD is invalid or has expired.",
  "AADSTS50133": "The session is not valid due to password expiration or recent password change.",
  "AADSTS50134": "Wrong data center. To authorize a request that was initiated by an app in the OAuth 2.0 device flow, the authorizing party must be in the same data center where the original request resides.",
  "AADSTS50135": "Password change is required due to account risk.",
  "AADSTS50136": "Single MSA session detected when requesting an MSA ticket.",
  "AADSTS50137": "Password needs to be changed due to security policy rule.",
  "AADSTS50138": "Invalid encryption key environment.",
  "AADSTS50139": "Session is invalid due to missing an external refresh token.",
  "AADSTS50140": "This occurred due to 'Keep me signed in' interrupt when the user was signing in.",
  "AADSTS50141": "Protected key is not intended for the authenticated user.",
  "AADSTS50142": "Password change is required due to a conditional access policy.",
  "AADSTS50143": "Session mismatch. The session is invalid because user tenant does not match the domain hint.",
  "AADSTS50144": "The user's Active Directory password has expired.",
  "AADSTS50146": "This application is required to be configured with an application-specific signing key. It is either not configured with one, or the key has expired or is not yet valid.",
  "AADSTS50147": "Invalid size of the code challenge parameter.",
  "AADSTS50148": "The code_verifier does not match the code_challenge supplied in the authorization request for PKCE.",
  "AADSTS50149": "Invalid Code_Challenge_method parameter.",
  "AADSTS50150": "The provided credentials does not have a valid user consent approval information.",
  "AADSTS50155": "Device authentication failed.",
  "AADSTS50156": "Device tokens are not supported for V2 resource.",
  "AADSTS50157": "User redirection required for routing.",
  "AADSTS50158": "External security challenge not satisfied. User will be redirected to another page or authentication provider to satisfy additional authentication challenges.",
  "AADSTS50159": "Claims sent by external provider are not enough.",
  "AADSTS50160": "Different target tenant is preferred.",
  "AADSTS50161": "Failed to validate authorization url of external claims provider.",
  "AADSTS50168": "The client is capable of utilizing the Windows 10 Accounts extension to perform SSO but no SSO token was found in the request or the token was expired. Request has been interrupted to attempt to pull an SSO token.",
  "AADSTS50169": "The realm '{realm}' is not a configured realm of the current service namespace.",
  "AADSTS50170": "The external controls mapping is missing.",
  "AADSTS50172": "External claims provider {provider} is not approved.",
  "AADSTS50173": "The provided grant has expired due to it being revoked, a fresh auth token is needed. The user might have changed or reset their password. The grant was issued on '{authTime}' and the TokensValidFrom date (before which tokens are not valid) for this user is '{validDate}'.",
  "AADSTS50176": "Missing definition of external control: {controlId}.",
  "AADSTS50177": "User account '{user}' from identity provider '{idp}' does not exist in tenant '{tenant}' and cannot access the application '{appId}'({appName}) in that tenant. The account needs to be added as an external user in the tenant first. Sign out and sign in again with a different Azure Active Directory user account.",
  "AADSTS50178": "User account '{user}' from identity provider '{idp}' does not exist in tenant '{tenant}' and cannot access the application '{appId}'({appName}) in that tenant. The account needs to be added as an external user in the tenant first. Sign out and sign in again with a different Azure Active Directory user account.",
  "AADSTS50179": "Client_info is not supported for this user.",
  "AADSTS50180": "Integrated Windows Authentication is needed. Enable the tenant '{name}' for Seamless SSO.",
  "AADSTS50181": "Unable to validate the otp.",
  "AADSTS50182": "OTP is already expired.",
  "AADSTS50183": "Cannot lookup otp due to cache error.",
  "AADSTS50184": "OTP is incorrect, or no cache entry exists for the tenant/user.",
  "AADSTS50185": "Email OTP notification delivery failed.",
  "AADSTS50186": "Unpermitted realm.",
  "AADSTS50187": "Failed to perform device authentication.",
  "AADSTS50189": "The device code is not correctly formatted.",
  "AADSTS50190": "Region prefix to connection string mapping returned from settings is null.",
  "AADSTS50192": "Invalid request.",
  "AADSTS50193": "Internal use",
  "AADSTS50194": "Application '{appId}'({appName}) is not configured as a multi-tenant application. Usage of the /common endpoint is not supported for such applications created after '{time}'. Use a tenant-specific endpoint or configure the application to be multi-tenant.",
  "AADSTS50196": "The server terminated an operation because it encountered a client request loop. Please contact your app vendor.",
  "AADSTS50197": "Sorry, we could not find the user, please sign-in again.",
  "AADSTS50199": "For security reasons, user confirmation is required for this request. Please repeat the request allowing user interaction.",
  "AADSTS50200": "Unpermitted external trusted realm.",
  "AADSTS50201": "This message prompt interrupt will be shown to the user during login when additional information should be provided to user.",
  "AADSTS50202": "User is not registered in the organization and must explicitly consent to the sign-in.",
  "AADSTS50203": "User has not registered the authenticator app and must register or snooze this notification.",
  "AADSTS50204": "External user has not consented to the privacy statement.",
  "AADSTS50205": "External user has consented to the privacy statement.",
  "AADSTS50206": "The user or administrator has not consented connecting to the target-device: '{identifier}'. Send an interactive authorization request for this user and target-machine.",
  "AADSTS50207": "This web native bridge interrupt will be shown to the user during login when the application is requesting login through the native broker and needs eSTS to ensure the broker is properly configured.",
  "AADSTS50208": "This web native bridge interrupt was shown, but the native bridge unexpectedly returned a different user.",
  "AADSTS50209": "User is performing a password reset.",
  "AADSTS53000": "Device is not in required device state: {state}. Conditional Access policy requires a compliant device, and the device is not compliant. The user must enroll their device with an approved MDM provider like Intune.",
  "AADSTS53001": "Device is not in required device state: {state}. Conditional Access policy requires a domain joined device, and the device is not domain joined.",
  "AADSTS53002": "Device is not in required device state: {state}. The app used is not an approved app for Conditional Access.",
  "AADSTS53004": "Cannot configure multi-factor authentication methods due to suspicious activity.",
  "AADSTS53005": "Application needs to enforce Intune protection policies.",
  "AADSTS53006": "Authentication required from federated idP.",
  "AADSTS53007": "Authentication required from federated IDP.",
  "AADSTS53008": "Browser not supported.",
  "AADSTS53009": "Application needs to enforce Intune protection policies.",
  "AADSTS53010": "Cannot configure multi-factor authentication methods because the organization requires this information to be set from specific locations or devices.",
  "AADSTS53011": "User blocked due to risk on home tenant.",
  "AADSTS54000": "User is not allowed to access application {appName} due to Legal Age Group Requirement of application {audience}.",
  "AADSTS54005": "OAuth2 Authorization code was already redeemed, please retry with a new valid code or use an existing refresh token.",
  "AADSTS54006": "Unencrypted v2 access tokens are not supported for first party applications that support consumer accounts. The resource must add a certificate to the onboarding portal to encrypt tokens.",
  "AADSTS54007": "Method not supported for IDP OAuth2 Federation.",
  "AADSTS54008": "Multi-Factor authentication is required and the credential used ({credentialName}) is not supported as a First Factor. Contact your administrator for more information.",
  "AADSTS54009": "Multi-Factor authentication is required and the credential used is not supported. Contact your administrator for more information.",
  "AADSTS54010": "Proofup blocked due to credential used not supported. Contact your administrator for more information.",
  "AADSTS65002": "Consent between first party application '{applicationId}' and first party resource '{resourceId}' must be configured via preauthorization - applications owned and operated by Microsoft must get approval from the API owner before requesting tokens for that API.",
  "AADSTS65003": "Consent for first party token-to-self must be configured via preauthorization. If preauthorization has already been configured, update the request to use a URI identifier for the resource instead of '{resourceId}' to work around this error.",
  "AADSTS65004": "User declined to consent to access the app.",
  "AADSTS65005": "The application '{name}' asked for scope '{scope}' that doesn't exist.",
  "AADSTS65006": "Resource '{resourceId}' had no entitlements matching required permissions configured on the required resource access for client '{clientId}'. Requested permission IDs: '{permissionId}'. This is a problem with one or more invalid permission ids on the client RRA configuration or the resource entitlement configuration.",
  "AADSTS65007": "Client '{clientId}' required resource access configuration has changed and therefore the request could not be completed. Please try again.",
  "AADSTS70024": "OIDC Provider Metadata missing required field '{fieldName}'.",
  "AADSTS70030": "Remote authentication failed to read session from storage.",
  "AADSTS70031": "Remote authentication session is in a bad state.",
  "AADSTS70033": "The remote auth session with this device code has already been approved.",
  "AADSTS70034": "The remote auth session with this device code has already been denied.",
  "AADSTS70035": "Remote auth session with this device code doesn't exist.",
  "AADSTS70036": "Unsupported remote auth session state.",
  "AADSTS70037": "Incorrect challenge response provided. Remote auth session denied.",
  "AADSTS70039": "The remote auth session with this device code has expired.",
  "AADSTS70041": "Unable to complete OAuth2 IdP's sign in. The 'nonce' claim does not match the expected value.",
  "AADSTS70043": "The refresh token has expired or is invalid due to sign-in frequency checks by conditional access. The token was issued on {issueDate} and the maximum allowed lifetime for this request is {time}.",
  "AADSTS70044": "The session has expired or is invalid due to sign-in frequency checks by conditional access.",
  "AADSTS70045": "The refresh token is invalid due to sign-in frequency checks by conditional access. Additionally, since the sign-in frequency policy applies to all applications, the token will never be usable, and should be deleted. The authInstant in this token was {authInstant} and the maximum allowed lifetime for this request is {time}.",
  "AADSTS70046": "The session has expired or is invalid due to re-authentication checks by conditional access.",
  "AADSTS81001": "Service ticket size exceeded the maximum allowed.",
  "AADSTS81004": "Kerberos authentication failed.",
  "AADSTS81005": "Authentication package is not supported.",
  "AADSTS81006": "No authorization header was found, returning 401 WWW-Authenticate.",
  "AADSTS81007": "Tenant is not enabled for DesktopSSO.",
  "AADSTS81008": "Failed to validate Kerberos ticket.",
  "AADSTS81009": "Unable to validate the user's Kerberos ticket, the authorization header value is not formatted correctly.",
  "AADSTS81010": "Seamless SSO failed because the user's Kerberos ticket has expired or is invalid.",
  "AADSTS81011": "Failed to find user by on-premise SID in the user's Kerberos ticket.",
  "AADSTS81012": "The user trying to sign in to Azure AD is different from the user signed into the device.",
  "AADSTS81013": "Failed to lookup the user whose kerberos ticket was used to login.",
  "AADSTS81014": "The DesktopSSO auth token has expired.",
  "AADSTS81015": "Rejecting DesktopSSO Kerberos ticket as it was obtained through delegation. Delegated Kerberos ticket does not originate from user directly. Please contact your tenant administrator to disable delegation on the AZUREADSSOACC account.",
  "AADSTS81016": "Invalid STS request.",
  "AADSTS90000": "Internal use",
  "AADSTS90004": "The request is not properly formatted.",
  "AADSTS90005": "Unable to complete request. The request was invalid since SID and login_hint cannot be used together.",
  "AADSTS90006": "A transient error has occurred. Please try again.",
  "AADSTS90007": "Bad Request. The passed session ID cannot be parsed.",
  "AADSTS90008": "The user or administrator has not consented to use the application with ID '{appId}'({appName}). This happened because application is misconfigured: it must require access to Microsoft Graph by specifying at least 'Sign in and read user profile' permission.",
  "AADSTS90009": "Application '{appId}'({appName}) is requesting a token for itself. This scenario is supported only if resource is specified using the GUID based App Identifier.",
  "AADSTS90010": "Unable to create {algoName} algorithm.",
  "AADSTS90012": "This request has timed out.",
  "AADSTS90013": "Invalid input received from the user.",
  "AADSTS90014": "The required field '{name}' is missing from the credential. Ensure that you have all the necessary parameters for the login request.",
  "AADSTS90015": "Requested query string is too long.",
  "AADSTS90016": "Invalid access token. Required claim is missing.",
  "AADSTS90017": "Unexpected field '{fieldName}'.",
  "AADSTS90019": "No tenant-identifying information found in either the request or implied by any provided credentials.",
  "AADSTS90020": "The SAML 1.1 Assertion is missing ImmutableID of the user.",
  "AADSTS90022": "Principal name format is invalid for '{name}'. Expected format: name[/instance][@realm]. The principal name is required, host and realm are optional and may be set to null.",
  "AADSTS90023": "Invalid STS request.",
  "AADSTS90024": "A transient error has occurred. Please try again.",
  "AADSTS90025": "Request processing has exceeded internal allowance. This operation will be retried internally and usually resolves without user impact. Please verify the end result of the transaction to verify status.",
  "AADSTS90026": "Hostname contains an invalid wildcard '*' character.",
  "AADSTS90027": "We are unable to issue tokens from this API version on the MSA tenant. Please contact the application vendor as they need to use version 2.0 of the protocol to support this.",
  "AADSTS90028": "Principal name format is invalid for name '{name}'. Primary component of the name is required.",
  "AADSTS90029": "The realm '{name}' is a Unicode domain name. Domain names of this form are not supported.",
  "AADSTS90030": "A transient error has occurred. Try again after some time.",
  "AADSTS90031": "A transient error has occurred. Try again after some time.",
  "AADSTS90032": "A transient error has occurred. Try again after some time.",
  "AADSTS90033": "A transient error has occurred. Please try again.",
  "AADSTS90035": "Service is temporarily unavailable. Please retry later.",
  "AADSTS90036": "An unexpected, non-retryable error stemming from the directory service has occurred.",
  "AADSTS90037": "Non-retryable error has occurred.",
  "AADSTS90038": "Tenant '{tenant_name}' request is being redirected to the National Cloud '{cloud}'.",
  "AADSTS90039": "Service is temporarily unavailable. Please retry later.",
  "AADSTS90040": "A non-retryable error has occurred.",
  "AADSTS90041": "A transient error has occurred. Please try again.",
  "AADSTS90042": "National Cloud Name is missing in the postback request.",
  "AADSTS90043": "OAuth2 grant was issued by National Cloud STS.",
  "AADSTS90044": "National Cloud Request Process Switched off.",
  "AADSTS90045": "Service is too busy. Please try again later.",
  "AADSTS90046": "Internal use",
  "AADSTS90047": "Internal use",
  "AADSTS90049": "Application could not be found.",
  "AADSTS90050": "Response content length from external IdP exceeds supported limit.",
  "AADSTS90051": "Invalid Delegation Token. Invalid national Cloud ID ({cloudId}) is specified.",
  "AADSTS90052": "Actual message content is runtime specific. Please see returned exception message for details.",
  "AADSTS90072": "User account '{user}' from identity provider '{idp}' does not exist in tenant '{tenant}' and cannot access the application '{application}'({appName}) in that tenant. The account needs to be added as an external user in the tenant first. Sign out and sign in again with a different Azure Active Directory user account",
  "AADSTS90073": "Invalid Fairfax Gateway Redirect.",
  "AADSTS90081": "An error occurred when the service tried to process a WS-Federation message. The message was invalid, malformatted, or contains potentially dangerous characters.",
  "AADSTS90082": "Authentication policy '{name}' selected for the request is not currently supported.",
  "AADSTS90083": "Request is unsupported.",
  "AADSTS90084": "Guest accounts are not allowed for this site.",
  "AADSTS90085": "The service is unable to issue a token because the company object hasn't been provisioned yet.",
  "AADSTS90086": "The user DA token is expired.",
  "AADSTS90087": "An error occurred while creating the WS-Federation message from the URI.",
  "AADSTS90088": "Authentication failed due to email address domain is not in allowed domains list for identity provider.",
  "AADSTS90089": "User token should not be used in App on behalf of flow.",
  "AADSTS90090": "A transient error has occurred. Please try again.",
  "AADSTS90091": "A transient error has occurred. Please try again.",
  "AADSTS90092": "Non-retryable error has occurred.",
  "AADSTS90093": "Actual message content is runtime specific. Please see returned exception message for details.",
  "AADSTS90094": "Admin consent is required for the permissions requested by this application.",
  "AADSTS90095": "Admin consent is required for the permissions requested by this application. An admin consent request may be sent to the admin.",
  "AADSTS90096": "Admin consent is required for the permissions requested by this application. Admin consent request sent for processing.",
  "AADSTS90097": "An error has occured during admin consent processing.",
  "AADSTS90098": "An unexpected approval request ID was provided.",
  "AADSTS90099": "The application '{appId}' ({appName}) has not been authorized in the tenant '{tenant}'. Applications must be authorized to access the customer tenant before partner delegated administrators can use them.",
  "AADSTS90100": "{name} parameter is empty or not valid.",
  "AADSTS90101": "The supplied data isn't a valid email address. Please provide it in the format someone@example.com",
  "AADSTS90102": "'{name}' value must be a valid absolute URI.",
  "AADSTS90107": "The request is not valid. Make sure your data doesn't have invalid characters.",
  "AADSTS90112": "Application identifier is expected to be a GUID.",
  "AADSTS90114": "The specified bulk AADJ token expiration timestamp will cause an expired token to be issued.",
  "AADSTS90116": "{method} request is made, while POST is the only supported verb.",
  "AADSTS90117": "Invalid request.",
  "AADSTS90119": "The user code is null or missing.",
  "AADSTS90120": "This request was already authorized or declined.",
  "AADSTS90121": "Invalid empty request.",
  "AADSTS90122": "User identifier is not present.",
  "AADSTS90123": "The token can't be issued because the identity or claim issuance provider denied the request. Response code: {errorCode}.",
  "AADSTS90124": "{resConstant} '{resourceId}' {resourceName} is not supported over the /common or /consumers endpoints. Please use the /organizations or tenant-specific endpoint.",
  "AADSTS90125": "{userName} isn't in our system. Make sure you entered the user name correctly.",
  "AADSTS90126": "User Type is not supported on this endpoint. The system can't infer the user's tenant from the user name: {userName}",
  "AADSTS90128": "Unable to load OptIn store for user.",
  "AADSTS90129": "{resConstant} '{resourceId}' {resourceName} has a configured token version of '1' and is not supported over the /common or /consumers endpoints.",
  "AADSTS90130": "{appConstant} '{appId}' {appName} is not supported over the /common or /consumers endpoints. Please use the /organizations or tenant-specific endpoint.",
  "AADSTS90131": "Invalid ambiguous request. sid cannot be used with prompt {prompt}.",
  "AADSTS90132": "The provided value for the input parameter 'device_code' is not valid. Device codes supporting the personal Microsoft Account sign-in audience can only be used for v2 common or consumers tenants.",
  "AADSTS90134": "Retrieving claims from identity provider '{idp}' failed.",
  "AADSTS90135": "The user decided not to continue the authentication. No remediation is required.",
  "AADSTS90136": "Device Code flow is not supported for Confidential Clients.",
  "AADSTS90137": "Token issuance cannot proceed because user declined consent approval to release their profile information.",
  "AADSTS90138": "Invalid ambiguous request. sid cannot be used with login_hint.",
  "AADSTS90139": "Invalid request. The device code flow connect mode in your request is only supported for the /consumers/ tenant.",
  "AADSTS90150": "Failed to read request.",
  "AADSTS90202": "A transient error has occurred. Please try again.",
  "AADSTS130001": "Signature key ID is not provided.",
  "AADSTS130004": "UserPrincipal doesn't have the NGC key configured.",
  "AADSTS130005": "NGC key signature verification failed.",
  "AADSTS130006": "The NGC transport key isn't configured on the device.",
  "AADSTS130007": "The device is disabled.",
  "AADSTS130008": "Device referenced by the NGC key is not found.",
  "AADSTS130009": "Device key was found weak.",
  "AADSTS130500": "Phone sign in was blocked due to User Credential Policy.",
  "AADSTS130501": "Sign in was blocked due to User Credential Policy.",
  "AADSTS130502": "Temporary Access Pass sign in was blocked due to User Credential Policy.",
  "AADSTS130503": "Your Temporary Access Pass is incorrect. If you don't know your pass, contact your administrator.",
  "AADSTS130504": "Your Temporary Access Pass has expired. Contact your administrator to obtain a new pass.",
  "AADSTS130505": "Your one-time Temporary Access Pass has been redeemed. Contact your admin to get a new pass.",
  "AADSTS130506": "Access Pass must be used for Web Sign In. Contact your admin to get an Access Pass.",
  "AADSTS130507": "An access pass could not be found or verified for the user.",
  "AADSTS135000": "Fido signature verification failed.",
  "AADSTS135001": "UserPrincipal doesn't have the key ID configured.",
  "AADSTS135002": "Fido key does not have authenticator data.",
  "AADSTS135003": "Fido assertion verification failed. Invalid gesture provided.",
  "AADSTS135004": "Invalid postBackUrl parameter.",
  "AADSTS135005": "Invalid cancelUrl parameter.",
  "AADSTS135006": "Invalid resumeUrl parameter.",
  "AADSTS135007": "Client data type is not valid.",
  "AADSTS135008": "Relying Party Origin is not valid.",
  "AADSTS135009": "Flow Token Scenario must be login scenario.",
  "AADSTS135010": "UserPrincipal doesn't have the key ID configured.",
  "AADSTS135011": "Device used during the authentication is disabled.",
  "AADSTS135012": "UserObjectId from the UserHandle does not match with UserPrincipal UserObjectId.",
  "AADSTS135013": "Invalid UserHandle prefix.",
  "AADSTS135014": "Invalid UserHandle length.",
  "AADSTS135015": "The FIDO exclude list was not a valid JSON blob.",
  "AADSTS135016": "FIDO sign-in is disabled via policy.",
  "AADSTS135017": "Unexpected Signature Counter received from authenticator.",
  "AADSTS135018": "Invalid challenge received from fido assertion.",
  "AADSTS135019": "Expired Challenge received from Fido assertion.",
  "AADSTS135020": "Invalid Fido assertion.",
  "AADSTS135021": "Invalid UserHandle prefix.",
  "AADSTS135022": "Redirect uri provided by MSA is not valid.",
  "AADSTS140000": "Request nonce is expired. Current time: {curTime}, expiry time of assertion {expTime}.",
  "AADSTS140001": "The session key is not valid.",
  "AADSTS140002": "Key not found",
  "AADSTS140003": "Nonce purpose not supported",
  "AADSTS140004": "Invalid Ticket Granting Ticket request.",
  "AADSTS140005": "Invalid Ticket Granting Ticket request.",
  "AADSTS140006": "Invalid Ticket Granting Ticket request.",
  "AADSTS140007": "Invalid Ticket Granting Service request.",
  "AADSTS140008": "Invalid ApReq assertion provided.",
  "AADSTS140009": "Kerberos crypto bad request",
  "AADSTS140010": "Kerberos ticket validation failure",
  "AADSTS160011": "Selected user account was invalid.",
  "AADSTS160021": "Application requested a user session which does not exist.",
  "AADSTS240000": "Limit for BulkAADJ tokens is reached for the tenant.",
  "AADSTS240001": "User is not authorized to register devices in Azure AD.",
  "AADSTS240002": "Input id_token cannot be used as 'urn:ietf:params:oauth:grant-type:jwt-bearer' grant.",
  "AADSTS240003": "Unexpected result from authorize endpoint call.",
  "AADSTS240004": "Authorization code not received from authorize endpoint call. Error: {errorInfo}",
  "AADSTS240005": "Missing required user role to acquire a bulk AADJ token. For more information please go to https://go.microsoft.com/fwlink/?linkid=2224591.",
  "AADSTS293004": "The target-device identifier in the request {targetDeviceId} was not found in the tenant {tenantId}.",
  "AADSTS300030": "not found",
  "AADSTS399206": "An unexpeted and non-retryable error happened when fetching bloomfilter data from blob storage.",
  "AADSTS399207": "The token request does not contain one or more supported response token type(s): '{ResType}'.",
  "AADSTS399208": "Registered certificates must not be used for token binding for public clients. Please use ephemeral client certificates.",
  "AADSTS399209": "Application '{appIdentifier}' does not have certificate-bound access tokens enabled.",
  "AADSTS399210": "A verifiable credential is required to access this resource.",
  "AADSTS399211": "Unable to find the requested DiskCache.",
  "AADSTS399212": "Requested DiskCache is expired.",
  "AADSTS399213": "The device key supplied is invalid.",
  "AADSTS399214": "The algorithm in the request is invalid.",
  "AADSTS399215": "HttpRequestException occurred in request to Dsts.",
  "AADSTS399216": "Timeout occurred in request to Dsts.",
  "AADSTS399217": "Non-retryable error has occurred.",
  "AADSTS399218": "For security reasons, user confirmation is required for this request. Please repeat the request allowing user interaction.",
  "AADSTS399219": "MSA Data Accessor transient timeout.",
  "AADSTS399220": "More than one service principal returned",
  "AADSTS399229": "Multiple MAM Browser client IDs are present in the claims collection. Values: {values}",
  "AADSTS399230": "MAM Browser application principal '{appPrincipalId}' is not valid in the directory",
  "AADSTS399231": "MAM Browser application principal '{appPrincipalId}' does not have any usable reply address in the directory",
  "AADSTS399232": "MAM Browser application principal '{appPrincipalId}' reply address validation failed. Reason: '{reason}'",
  "AADSTS399233": "DstsCache is missing the Signingkey info",
  "AADSTS399234": "Recieved public Signingkey response has XML parsing error",
  "AADSTS399235": "Invalid Soap Headers passed to Dsts request",
  "AADSTS399236": "Invalid Soap Body passed to Dsts request",
  "AADSTS399237": "Failure when proxying a request from DstsCache to legacy dSTS",
  "AADSTS500011": "The resource principal named {name} was not found in the tenant named {tenant}. This can happen if the application has not been installed by the administrator of the tenant or consented to by any user in the tenant. You might have sent your authentication request to the wrong tenant.",
  "AADSTS500012": "Resource application name '{name}' is not valid.",
  "AADSTS500013": "Resource identifier is not provided.",
  "AADSTS500014": "The service principal for resource '{identifier}' is disabled. This indicate that a subscription within the tenant has lapsed, or that the administrator for this tenant has disabled the application, preventing tokens from being issued for it.",
  "AADSTS500015": "MSA provisioned resources are not supported in the tenant named {tenant}.",
  "AADSTS500016": "Application '{appIdentifier}' is not supported as a resource application to execute the flow.",
  "AADSTS500017": "Application '{appIdentifier}' is not allowed as a resource application to execute the flow.",
  "AADSTS500021": "Access to '{tenant}' tenant is denied.",
  "AADSTS500022": "Access to '{tenant}' tenant is denied.",
  "AADSTS500023": "'{headerFromCredential}' is not the same as '{headerFromRequest}'.",
  "AADSTS500024": "Conflicting tenant restrictions signals received by the server on the login request. The header indicated '{headerFromRequest}' while the application added a claims request for '{headerFromClaims}'. This can indicate conflicting network and device policies, which Azure AD does not support.",
  "AADSTS500025": "Conflicting tenant restrictions signals received by the server from a claims request. The header from the Id Token '{headerFromIdToken}' is different than the header from the access token '{headerFromAccessToken}'.",
  "AADSTS500031": "Cannot find signing certificate configured.",
  "AADSTS500032": "Cannot find signing certificate/private key to issue a certificate.",
  "AADSTS500033": "There is an issue with the key '{kid}'. It has both x5t and x5c values, but they do not match. Please make sure the x5t value is the Base64Url-encoded SHA-1 thumbprint of the first certificate in x5c.",
  "AADSTS500061": "Assertion failed signature validation.",
  "AADSTS500081": "SAML assertion validation failed: no supported token signature is provided.",
  "AADSTS500082": "SAML assertion is not present in the token.",
  "AADSTS500083": "Unable to verify token signature. No trusted realm was found with identifier '{issuer}'.",
  "AADSTS500084": "Cannot read SecurityToken. Expected element is ({expectedName}, {expectedNamespace}) the actual element is ({localName}, {actualNamespace}).",
  "AADSTS500085": "SAML Assertion with MajorVersion '{actualMajor}' and MinorVersion '{actualMinor}' is not supported. The supported version is MajorVersion '{major}' and MinorVersion '{minor}'.",
  "AADSTS500086": "SAML Assertion AssertionId '{id}' is not a valid xsd:ID value.",
  "AADSTS500087": "SAML Assertion does not have any SAML Statement elements. SAML Assertion must have at least one SAML Statement element.",
  "AADSTS500088": "SAML Assertion is missing the required '{name}' Attribute.",
  "AADSTS500089": "SAML 2.0 assertion validation failed: {details}",
  "AADSTS500101": "Audience URI validation failed. No token audiences were found.",
  "AADSTS500102": "Audience URI validation failed. No allowed audiences are configured.",
  "AADSTS500103": "Validation of Audience URI(s) {uri} failed. No match was found with allowed audience(s) {audience}.",
  "AADSTS500111": "The reply uri specified in the request has an invalid scheme.",
  "AADSTS500112": "The reply address '{actual}' does not match the reply address '{provided}' provided when requesting Authorization code.",
  "AADSTS500113": "No reply address is registered for the application{idPhrase}.",
  "AADSTS500114": "Protocol not specified for reply address validation.",
  "AADSTS500115": "The reply uri specified in the request is missing or not a valid URL.",
  "AADSTS500116": "The reply uri specified in the request is not a valid URL. Allowed schemes: '{schemes}'.",
  "AADSTS500117": "The reply uri specified in the request isn't using a secure scheme.",
  "AADSTS500118": "The reply uri specified in the request failed validation. The reply uri host must match one of the registered DNS host names '{host}' for site with ID '{id}'.",
  "AADSTS500119": "Redirect URIs with urn: schemes are prohibited. Use a different scheme, or https://login.microsoftonline.com/common/oauth2/nativeclient",
  "AADSTS500121": "Authentication failed during strong authentication request.",
  "AADSTS500122": "SWT assertion failed signature validation. Actual message content is runtime specific. Please see returned exception message for details.",
  "AADSTS500123": "SWT assertion failed signature validation. Actual message content is runtime specific. Please see returned exception message for details.",
  "AADSTS500124": "No device secret is provisioned in the store.",
  "AADSTS500125": "Invalid device secret is provided.",
  "AADSTS500126": "External ID token from issuer '{issuer}' failed signature verification. KeyID of token is '{identifier}'.",
  "AADSTS500127": "No authenticated credentials found in request.",
  "AADSTS500128": "No session key found.",
  "AADSTS500129": "No NGC transport key found.",
  "AADSTS500131": "Assertion audience does not match the Client app presenting the assertion. The audience in the assertion was '{tokenAudience}' and the expected audience is '{expectedAudience}' or one of the Application Uris of this application with App ID '{appId}'({appName}). The downstream client must request a token for the expected audience (the application that made the OBO request) and this application should use that token as the assertion.",
  "AADSTS500132": "Assertion is malformed and cannot be read.",
  "AADSTS500133": "Assertion is not within its valid time range. Ensure that the access token is not expired before using it for user assertion, or request a new token. Current time: {curTime}, expiry time of assertion {expTime}.",
  "AADSTS500135": "Authentication code is missing in the assertion.",
  "AADSTS500136": "The token issuer doesn't match the api version: A version 2 token can only be used with the v2 endpoint.",
  "AADSTS500137": "The token issuer doesn't match the api version: A version 1 token cannot be used with the v2 endpoint.",
  "AADSTS500138": "No Refresh Token claim provided in the assertion.",
  "AADSTS500139": "Refresh token in the assertion is not a primary refresh token.",
  "AADSTS500141": "The user's redemption is complete but the request was not initiated by the target application.",
  "AADSTS500142": "The user's redemption is complete and the sign-in should continue.",
  "AADSTS500183": "Certificate has been revoked.",
  "AADSTS500184": "Client assertion JWT token failed verification during certificate based authentication. The token is not signed by the certificate provided in the token.",
  "AADSTS500185": "Tenant differs between user login and certificate user.",
  "AADSTS500186": "User not allowed by policy conditions.",
  "AADSTS500187": "Selected certificate does not meet the criteria.",
  "AADSTS500200": "User account '{email}' is a personal Microsoft account. Personal Microsoft accounts are not supported for this application unless explicitly invited to an organization. Try signing out and signing back in with an organizational account.",
  "AADSTS500201": "We are unable to issue tokens from this API version for a Microsoft account. Please contact the application vendor as they need to use version 2.0 of the protocol to support this.",
  "AADSTS500202": "User account '{email}' from external identity provider '{idp}' is not supported for API version '{version}'. Microsoft account pass-thru users and guests are not supported by the tenant-independent endpoint.",
  "AADSTS500204": "Microsoft account '{email}' can’t be used to log in to application {appName}. Please get this user invited to {tenant} directory or sign out and sign in again with a Work or School account.",
  "AADSTS500205": "A consumer (B2C) account can't be used to log into non consumer applications.",
  "AADSTS500206": "The account type can't be used for the application you're trying to log into.",
  "AADSTS500207": "The account type can't be used for the resource you're trying to access.",
  "AADSTS500208": "The domain is not a valid login domain for the account type.",
  "AADSTS500209": "Unspecific Tenant is not supported in this domain.",
  "AADSTS500210": "Domain name does not match with the tenant identifier",
  "AADSTS500211": "User account '{email}' from identity provider '{idp}' does not exist in tenant '{tenant}' and cannot access the application '{appId}'({appName}) in that tenant. The account needs to be added as an external user in the tenant first. Sign out and sign in again with a different Azure Active Directory user account.",
  "AADSTS500212": "The user's administrator has set an outbound access policy that does not allow access to the resource tenant.",
  "AADSTS500213": "The resource tenant's cross-tenant access policy does not allow this user to access this tenant.",
  "AADSTS500277": "External ID Token has unexpected issuer: {issuer}.",
  "AADSTS500331": "An error occurred while attempting to create a certificate from bytes.",
  "AADSTS500341": "The user account {identifier} has been deleted from the {tenant} directory. To sign into this application, the account must be added to the directory.",
  "AADSTS500342": "User account is not configured for remote NGC.",
  "AADSTS500343": "Could not create remote sign-in session.",
  "AADSTS500344": "User Account is not found for Fido Sign in flow.",
  "AADSTS500346": "E-Mail OTP user cannot sign in with local password.",
  "AADSTS500571": "The guest user account is disabled.",
  "AADSTS500581": "Rendering JavaScript. Fetching sessions for single-sign-on on V2 with prompt=none requires javascript to verify if any MSA accounts are signed in.",
  "AADSTS500582": "Microsoft Account session_id with prompt=none not supported on AAD tenant.",
  "AADSTS500583": "Storage Access required.",
  "AADSTS500881": "Limit on telecom MFA calls reached. Please retry with PhoneAppNotification or try again in a few minutes.",
  "AADSTS500882": "Limit on telecom MFA calls reached. Please retry with PhoneAppCode or try again in a few minutes.",
  "AADSTS500883": "Limit on telecom MFA calls reached. Please retry with CompanionAppsNotification or try again in a few minutes.",
  "AADSTS501241": "Mandatory Input '{paramName}' missing from transformation id '{transformId}'.",
  "AADSTS501271": "Broker app needs to be installed for device authentication to succeed.",
  "AADSTS501291": "Client app is a Mam app, device is not registered and request is sent using a broker. Work place join needs to be done to register the device before the app can be accessed.",
  "AADSTS501292": "Client application cannot satisfy app protection requirement. If it's a first party app, then it's not whitelisted to be used with app protection policies, otherwise, the app has not advertised as app-compliant capable, or the authentication library used does not support app protection policies.",
  "AADSTS501293": "The device is not workplace joined. To proceed with the 'Sign in from another device' option, this device must be workplace joined.",
  "AADSTS501311": "Browser not supported.",
  "AADSTS501312": "Device used during the authentication is not registered for the account.",
  "AADSTS501313": "Your device is required to be managed to access this resource.",
  "AADSTS501314": "Silent interrupt required to recognize browser capabilities. Used to differentiate between Safari running in iPadOS or Mac.",
  "AADSTS501471": "Missing code_challenge parameter.",
  "AADSTS501481": "The Code_Verifier does not match the code_challenge supplied in the authorization request.",
  "AADSTS501482": "The Code_Verifier length is less than invalid.",
  "AADSTS501491": "Invalid size of Code_Challenge parameter.",
  "AADSTS501811": "OTP is incorrect, or no cache entry exists for the tenant/user.",
  "AADSTS530001": "Browser not supported.",
  "AADSTS530002": "Your device is required to be compliant to access this resource.",
  "AADSTS530003": "Your device is required to be managed to access this resource.",
  "AADSTS530004": "AcceptCompliantDevice setting isn't configured for this organization. The admin needs to configure this setting to allow external users access to protected resources.",
  "AADSTS530011": "Browser not supported.",
  "AADSTS530021": "Application does not meet the conditional access approved app requirements.",
  "AADSTS530022": "Browser not supported.",
  "AADSTS530031": "Access policy does not allow token issuance.",
  "AADSTS530032": "User blocked due to risk on home tenant.",
  "AADSTS530033": "Remote device flow blocked due to device based conditional access.",
  "AADSTS530034": "A delegated administrator was blocked from accessing the tenant due to account risk.",
  "AADSTS530035": "Access has been blocked by security defaults.",
  "AADSTS530081": "Managed browser or Microsoft Edge is required for device registration to succeed.",
  "AADSTS650011": "The user or administrator has not consented to use the application with ID '{identifier}'{namePhrase}. Send an interactive authorization request for this user and resource. Alternatively, the Application URI {uri} for the App:'{appId}'{name} in the tenant '{tenant}' might be in conflict with the Application URI for the multitenant app '{conflict}'. Update the registered Application URI to something else to avoid the conflict.",
  "AADSTS650041": "User terminated the request.",
  "AADSTS650051": "Actual message content is runtime specific. Please see returned exception message for details.",
  "AADSTS650052": "The app is trying to access a service '{appId}'({appName}) that your organization '{organization}' lacks a service principal for. Contact your IT Admin to review the configuration of your service subscriptions or consent to the application in order to create the required service principal.",
  "AADSTS650053": "The application '{name}' asked for scope '{scope}' that doesn't exist on the resource '{resource}'. Contact the app vendor.",
  "AADSTS650054": "The application '{name}' asked for permissions to access a resource that has been removed or is no longer available. Contact the app vendor.",
  "AADSTS650055": "The application '{name}' required resource access list does not contain applications discoverable by '{resource}'.",
  "AADSTS650056": "Misconfigured application. This could be due to one of the following: the client has not listed any permissions for '{name}' in the requested permissions in the client's application registration. Or, the admin has not consented in the tenant. Or, check the application identifier in the request to ensure it matches the configured client application identifier. Or, check the certificate in the request to ensure it's valid. Please contact your admin to fix the configuration or consent on behalf of the tenant. Client app ID: {id}.",
  "AADSTS650057": "Invalid resource. The client has requested access to a resource which is not listed in the requested permissions in the client's application registration. Client app ID: {appId}({appName}). Resource value from request: {resource}. Resource app ID: {resourceAppId}. List of valid resources from app registration: {regList}.",
  "AADSTS650058": "The app needs access to a service that your organization has not subscribed to or enabled. Contact your IT Admin to review the configuration of your service subscriptions.",
  "AADSTS650061": "The client application {appDisplayName} ({applicationId}) requested the role {roleName} ({roleId}) on the resource application {resourceDisplayName} ({resourceId}) but this role is only assignable to users. Either the client application vendor must remove the role from the requested roles, or the owner of the resource application must allow the role to be assignable to applications. For more information, see https://docs.microsoft.com/azure/active-directory/develop/howto-add-app-roles-in-azure-ad-apps",
  "AADSTS700001": "Application: {samlAudience} needs to opt-in for 'aio' optional claim for On Behalf Of flow to work with SAML tokens issued to this application",
  "AADSTS700002": "SAML 1.1 Bearer assertion must be a valid Base64 encoded value.",
  "AADSTS700003": "Device object was not found in the tenant '{tenantName}' directory.",
  "AADSTS700004": "onpremobjectguid '{objGuid}' attribute in the presented grant is malformed.",
  "AADSTS700005": "Provided Authorization Code is intended to use against other tenant, thus rejected.",
  "AADSTS700006": "The Audience: {audience} of the token is NOT an absolute Uri",
  "AADSTS700007": "The grant was issued for a different client id.",
  "AADSTS700008": "Social IDP users are not expected to have home tenant.",
  "AADSTS700009": "Reply address must be provided when presenting an authorization code requested with an explicit reply address.",
  "AADSTS700011": "Application with identifier {appIdentifier} was not found in the directory.",
  "AADSTS700012": "Missing Authorization header with bearer token. Client was not authenticated.",
  "AADSTS700013": "Client is not authorized to request managed browser purpose token.",
  "AADSTS700014": "Mobile Edge app needs to provide an enrollment id in order to acquire a purpose token that can satisfy the compliant app requirement.",
  "AADSTS700017": "{resourceConstant} '{resourceIdentifier}' is not supported as resource.",
  "AADSTS700018": "{resourceConstant} '{resourceIdentifier}' is not supported as resource.",
  "AADSTS700019": "Application ID {identifier} cannot be used or is not authorized.",
  "AADSTS700020": "Application ID {identifier} is a reserved identifier and should be removed on the application: {applicationId}.",
  "AADSTS700021": "Client assertion application identifier doesn't match 'client_id' parameter. Review the documentation at https://docs.microsoft.com/azure/active-directory/develop/active-directory-certificate-credentials .",
  "AADSTS700022": "No Subject claim provided in the assertion. Review the documentation at https://docs.microsoft.com/azure/active-directory/develop/active-directory-certificate-credentials .",
  "AADSTS700023": "Client assertion audience claim does not match Realm issuer. Review the documentation at https://docs.microsoft.com/azure/active-directory/develop/active-directory-certificate-credentials .",
  "AADSTS700024": "Client assertion is not within its valid time range. Current time: {curTime}, assertion valid from {validTime}, expiry time of assertion {expTime}. Review the documentation at https://docs.microsoft.com/azure/active-directory/develop/active-directory-certificate-credentials .",
  "AADSTS700025": "Client is public so neither 'client_assertion' nor 'client_secret' should be presented.",
  "AADSTS700026": "Client application has no configured keys.",
  "AADSTS700027": "Client assertion failed signature validation.",
  "AADSTS700028": "Certificate with thumbprint {thumbprint} is not authorized.",
  "AADSTS700029": "Invalid signing certificate.",
  "AADSTS700030": "Invalid certificate - subject name in certificate is not authorized. SubjectNames/SubjectAlternativeNames (up to 10) in token certificate are: {certificateSubjects}.",
  "AADSTS700031": "Invalid certificate - SubjectName or SubjectAlternativeName is missing",
  "AADSTS700032": "Invalid certificate - Trusted Certificate Subjects for application are missing",
  "AADSTS700033": "For asserting custom_claims, client must provide either xms_actor_token or subject name issuer certificate with custom claim allowed values.",
  "AADSTS700034": "Client assertion contains an invalid xms_actor_token claim.",
  "AADSTS700035": "Client assertion contains custom_claims in the incorrect format.",
  "AADSTS700036": "Client is not authorized to override managed identity claim in the token.",
  "AADSTS700037": "Client assertion must declare x5c header when overriding managed resource ID.",
  "AADSTS700038": "00000000-0000-0000-0000-000000000000 is not a valid application identifier.",
  "AADSTS700039": "00000000-0000-0000-0000-000000000000 is not a valid resource identifier",
  "AADSTS700040": "Managed Resource ID '{inputManagedResourceId}' is not a valid resource identifier.",
  "AADSTS700041": "Post-logout redirect uri is not in approved list. Requested post-logout url: {url}.",
  "AADSTS700042": "The reply address does not match the reply addresses configured for the application.",
  "AADSTS700043": "The redirect address '{address}' does not match the redirect addresses configured for service identity '{serviceId}'.",
  "AADSTS700044": "The redirect address '{address}' corresponding to this authorization code does not match the redirect address '{requestAddress}' specified in the request.",
  "AADSTS700045": "Redirect address '{address}' specified by the client does not match any configured addresses '{configuredAddress}' or any addresses on the OIDC approve list.",
  "AADSTS700046": "Invalid Reply Address. Reply Address must have scheme brk-{brkApplicationId}:// and be of Single Page Application type.",
  "AADSTS700047": "Invalid Reply Address. Broker must use Single-Page Application Reply Address.",
  "AADSTS700048": "Client assertion contains an invalid xms_actor_token claim. The audience of the claim is not correctly set.",
  "AADSTS700049": "Claim override is only allowed for User Assigned Managed Service Identities. Make sure the caller app is a Managed Identity, and the override is being done for a User Assigned identity.",
  "AADSTS700050": "Actor token is not within its valid time range. Current time: {curTime}, expiry time of actor token {expTime}.",
  "AADSTS700051": "response_type 'token' is not enabled for the application.",
  "AADSTS700052": "The token request contains one or more unsupported response token type(s): '{ResType}'.",
  "AADSTS700053": "response_type 'id_token' requires the 'openid' scope.",
  "AADSTS700054": "response_type 'id_token' is not enabled for the application.",
  "AADSTS700055": "Redirection to B2C first party app is permitted only to the /authresp endpoint.",
  "AADSTS700056": "User account does not exist in organization.",
  "AADSTS700081": "The refresh token has expired due to maximum lifetime. The token was issued on {issueDate} and the maximum allowed lifetime for this application is {time}.",
  "AADSTS700082": "The refresh token has expired due to inactivity. The token was issued on {issueDate} and was inactive for {time}.",
  "AADSTS700083": "The primary refresh token has expired due to maximum lifetime. The token was issued on {issueDate} and the maximum allowed lifetime for this application is {time}.",
  "AADSTS700084": "The refresh token was issued to a single page app (SPA), and therefore has a fixed, limited lifetime of {time}, which cannot be extended. It is now expired and a new sign in request must be sent by the SPA to the sign in page. The token was issued on {issueDate}.",
  "AADSTS900143": "'{name}' is required for the '{type}' grant type.",
  "AADSTS900144": "The request body must contain the following parameter: '{name}'.",
  "AADSTS900161": "Invalid access token. Required tenant ID claim is missing.",
  "AADSTS900941": "Administrator consent is required. App is considered risky.",
  "AADSTS900942": "Admin consent is required in order to allow token to be issued for clients to access resource.",
  "AADSTS900971": "No reply address provided.",
  "AADSTS1000005": "Invalid definition for external identity provider, domain is missing",
  "AADSTS1000006": "Invalid definition for external identity provider with domain '{domain}'. Reason: Following properties are mandatory: domain, issuer URI, passive authentication URL.",
  "AADSTS1000007": "Invalid definition for external identity provider with domain '{domain}'. Reason: The value '{url}' in the property '{urlType}' must be an absolute URL.",
  "AADSTS1000008": "Invalid definition for external identity provider with domain '{domain}'. Reason: The value '{url}' in the property '{urlType}' must be https.",
  "AADSTS1000009": "Invalid definition for external identity provider with domain '{domain}'. Reason: Only WsFederation/SamlP/OAuth2 protocols are allowed.",
  "AADSTS1000010": "Invalid definition for external identity provider with domain '{domain}'. Reason: Domain '{value}' is not in expected format.",
  "AADSTS1000011": "Invalid definition for external identity provider with domain '{domain}'. Reason: Issuer '{value}' is not in expected format.",
  "AADSTS1000012": "Invalid definition for external identity provider with domain '{domain}'. Reason: Domain '{value}' is a reserved value.",
  "AADSTS1000013": "Invalid definition for external identity provider with domain '{domain}'. Reason: Issuer '{value}' is a reserved value.",
  "AADSTS1000014": "Cannot issue On-Behalf-Of token for tenant '{tenant1}' as JWT bearer token was issued for '{tenant2}'.",
  "AADSTS1000015": "Direct federation users are not expected to have home tenant.",
  "AADSTS1000018": "Realm with domain '{domain}' is not an external realm.",
  "AADSTS1000019": "The provided certificate authority type '{certificateAuthorityType}' is not valid.",
  "AADSTS1000020": "The provided application '{applicationId}' may not be used on this endpoint.",
  "AADSTS1000021": "External Claims Provider unavailable: general exception.",
  "AADSTS1000022": "External Claims Provider unavailable: WebException status code '{status}'.",
  "AADSTS1000023": "The GitHub access token forwarded exceeds the configured length of '{sizeLimit}'.",
  "AADSTS1000024": "Requested claim 'ClientIpReportedByRP' should have a single and valid ip address.",
  "AADSTS1000025": "Received invalid stk_jwk.",
  "AADSTS1000026": "Received invalid Primary Refresh Token.",
  "AADSTS1000027": "Session Transport Key is not present.",
  "AADSTS1000028": "Received invalid Windows SSO Credential.",
  "AADSTS1000029": "The provided confirmation request (req_cnf or pop_jwk) is not properly formatted.",
  "AADSTS1000030": "Microsoft Account granted Refresh Token Credential is not supported on AAD tenant.",
  "AADSTS1000031": "Application {appDisplayName} cannot be accessed at this time. Contact your administrator.",
  "AADSTS1000032": "Received invalid stk_jwk key thumbprint.",
  "AADSTS1000033": "Stk_jwk key doesn't match session transport key thumbprint specified at the beginning of the session.",
  "AADSTS1000034": "Stk_jwk key must not be submitted via x5c.",
  "AADSTS1000035": "There was an error issuing Bound RT token.",
  "AADSTS1000036": "BoundRT use as a bearer refresh token is unsupported.",
  "AADSTS1000037": "Stk_jwk thumbprint is not provided for SSO Bound RT redemption.",
  "AADSTS1000038": "Received invalid req_cnf key thumbprint.",
  "AADSTS1000039": "Req_cnf key '{kid}' doesn't match proof of possession key thumbprint specified at the beginning of the session.",
  "AADSTS1000040": "Received invalid dk_jwk key thumbprint.",
  "AADSTS1000104": "Resource cloud {resourceCloud} is not allowed on identity tenant {identityTenant}.",
  "AADSTS1000501": "Unable to read session document from Session Store.",
  "AADSTS1000502": "The provided certificate is not within its specified validity window.",
  "AADSTS1000503": "Request contains mismatched device ids.",
  "AADSTS1000701": "Multiple devices with the same device-name found in tenant {tenant}. Please reach out to your tenant-admin to ensure uniqueness of device display-name.",
  "AADSTS1002001": "The device template was not found in the tenant '{tenantName}'.",
  "AADSTS1002002": "The Cert Based Auth Configuration was not found in the tenant '{tenantName}' or was invalid.",
  "AADSTS1002003": "The TLS certificate provided does not match the certificate on the device.",
  "AADSTS1002004": "The MTLS subject was not found in the subject or SAN list.",
  "AADSTS1002005": "Device in tenant '{tenantName}' does not have suitable credentials.",
  "AADSTS1002006": "Request contains empty or invalid subject.",
  "AADSTS1002007": "Missing required roles to access token evaluation data endpoint, roles present in the token is {roles}",
  "AADSTS1002008": "Unable to authorize to the token evaluation data endpoint. Tenant Identifier in the request: {requestTenant} does not match tenant identifier in the token: {tenantIdInToken}",
  "AADSTS1002009": "Unable to authorize to the token evaluation data endpoint. Unexpected scope present in the bearer token, app delegation(service principal obo) token is not supported to access the endpoint.",
  "AADSTS1002010": "There was an error on fetching revocaton data or issue with token evaluation data endpoint.",
  "AADSTS1002011": "The tenant branding cdn domains are not configured for the private link.",
  "AADSTS1002012": "The provided value for scope {scope} is not valid. Client credential flows must have a scope value with /.default suffixed to the resource identifier (application ID URI).",
  "AADSTS1002014": "Unable to complete request. The request was invalid since domain_hint and opaque login_hint cannot be used together.",
  "AADSTS1002016": "You are using TLS version 1.0, 1.1 and/or 3DES cipher which are deprecated to improve the security posture of Azure AD. Your TenantID is: {tenantId}. Please refer to https://go.microsoft.com/fwlink/?linkid=2161187 and conduct needed actions to remediate the issue. For further questions, please contact your administrator.",
  "AADSTS1002017": "Bad Request. The passed logout_hint cannot be parsed.",
  "AADSTS1002021": "The version of client library you are using is not supported for accessing resources in another Microsoft cloud as a guest.",
  "AADSTS1002022": "A transient error occurred while attempting to fetch bloom filter data. Please try again later.",
  "AADSTS1002023": "Invalid grant. Device authentication is required from a specific tenant.",
  "AADSTS1002024": "A primary refresh token must be redeemed with a prt protocol version.",
  "AADSTS1002026": "Common endpoint for app tokens is on the deprecation path and not supported on regional AAD. Please use the tenanted endpoint instead.",
  "AADSTS1002027": "Some of the collected attributes were invalid.",
  "AADSTS1002028": "Missing required roles to access partitioned token signing key endpoint, roles present in the token is {roles}",
  "AADSTS1002029": "Unable to authorize to the partitioned token signing key endpoint. Unexpected scope present in the bearer token, app delegation(service principal obo) token is not supported to access the endpoint.",
  "AADSTS1002030": "Internal service error occured in first party app token validator.",
  "AADSTS1003012": "The custom extension returned an invalid action type defined for that custom extension type.",
  "AADSTS1003013": "Invalid request. Nonce from artifact has expired.",
  "AADSTS1003014": "The custom extension resourceId should be in the format of api://fully qualified domain name/appid.",
  "AADSTS1003015": "The targetUrl and resourceId of the custom extension should have the same fully qualified domain name.",
  "AADSTS1003016": "The appId of the custom extension resourceId should correspond to a real service principal in the tenant.",
  "AADSTS1003017": "The Azure Active Directory Authentication Extensions service principal not found in tenant.",
  "AADSTS1003018": "The Azure Active Directory Authentication Extensions service principal is disabled in this tenant.",
  "AADSTS1003019": "The custom extension resource service principal is disabled in this tenant.",
  "AADSTS1003020": "The target URL is in an improper format. It's must be a valid URL that start with https://",
  "AADSTS1003021": "The permission CustomAuthenticationExtension.Receive.Payload is not granted to the service principal of the resource app.",
  "AADSTS1003022": "The MS Graph service principal is disabled or not found in this tenant.",
  "AADSTS1003023": "The endpoint used for the custom extension is blocked by the service.",
  "AADSTS1003024": "The custom extension response size exceeded the maximum limit.",
  "AADSTS1003025": "The total size of claims in the custom extension response exceeded the maximum limit.",
  "AADSTS1003026": "The custom extension API responded with claims containing null or empty key.",
  "AADSTS1003027": "Error connecting to the custom extension API.",
  "AADSTS1003030": "A transient error occurred while authenticating an MSA (consumer) user.",
  "AADSTS1003031": "Misconfigured required resource access in client application registration.",
  "AADSTS1003032": "The bluestone storage account in TokenEvaluationData endpoint has not been successfully initialized",
  "AADSTS1003033": "The remote ngc session was denied.",
  "AADSTS1003034": "Your organization is not configured to sign in this type of personal Microsoft account. Visit https://aka.ms/MSAUnprotectedAccountsGuidance for more details.",
  "AADSTS1003035": "The json web key supplied is invalid.",
  "AADSTS1003036": "Partitioned token signing key feature is not set properly.",
  "AADSTS1003037": "It looks like you may already have an account with us using this email address. Try signing in again with another identity provider.",
  "AADSTS1003038": "Root token signing key is not found.",
  "AADSTS1003039": "Partitioned token signing key is not found.",
  "AADSTS2205013": "Certificate Revocation List (CRL) download is currently in progress. Please try again in few minutes.",
  "AADSTS5000611": "Symmetric Key Derivation Function version '{version}' is invalid.",
  "AADSTS5000811": "Unable to verify token signature. The signing key identifier does not match any valid registered keys.",
  "AADSTS5001210": "Unsupported transport key format.",
  "AADSTS5001211": "Unable to create primary refresh token.",
  "AADSTS5001212": "Device authentication is required to issue primary refresh token.",
  "AADSTS5001213": "Windows Integrated authentication is needed. Unable to use Seamless SSO to authenticate the user.",
  "AADSTS5001214": "Authentication failed.",
  "AADSTS5002726": "Invalid JWT token. Found unsupported token header. Supported headers are runtime specific based on keys.",
  "AADSTS7000011": "Requested SAML 2.0 assertion has invalid SubjectConfirmation Method: {method}.",
  "AADSTS7000012": "The grant was obtained for a different tenant.",
  "AADSTS7000013": "The grant is not supported by API version {apiVersion}.",
  "AADSTS7000014": "The provided value for the input parameter 'device_code' is not valid.",
  "AADSTS7000015": "The grant was obtained for a different tenant.",
  "AADSTS7000016": "Primary refresh token is not signed with session key.",
  "AADSTS7000017": "Broker restricted refresh token can't be used as credential.",
  "AADSTS7000018": "Token binding header is empty.",
  "AADSTS7000019": "Token binding hash does not match.",
  "AADSTS7000020": "SAML 2.0 Bearer assertion must be a valid Base64Url encoded value.",
  "AADSTS7000021": "Unrecognized grant type {type}.",
  "AADSTS7000022": "VSM Binding Key missing from Ticket Granting Ticket request.",
  "AADSTS7000023": "VSM Binding key mismatch.",
  "AADSTS7000024": "Inconsistent broker application IDs asserted by incoming credentials.",
  "AADSTS7000025": "Ambiguous request. The grant contains duplicate claims.",
  "AADSTS7000026": "Provided grant is invalid or malformed. The grant requires an encrypted response, but the client is not indicating it understands encrypted responses.",
  "AADSTS7000027": "An emergency refresh token is present but rejected.",
  "AADSTS7000028": "Attestation key is required for this request but it doesn't exist in the device. Please consider re-enrolling the device.",
  "AADSTS7000029": "The token binding claim is invalid because it was not generated on the same device as attestation key. Please verify the legitimacy of the device.",
  "AADSTS7000030": "The token binding claim is invalid because the thumbprint of binding key does not match the thumbprint in the binding claim or the thumbprint in the binding claim is missing. Please verify the legitimacy of the device.",
  "AADSTS7000031": "The signing algorithm {algorithm} of attestation key is not supported. Please consider re-enrolling the device and update the attestation key.",
  "AADSTS7000032": "The security enclave type {enclave} of the token binding key is unknown. Please consider re-enrolling the device.",
  "AADSTS7000033": "Token doesn't contain expected claim: '{claim}'.",
  "AADSTS7000034": "The token binding claim is malformatted. Please consider re-enrolling the device.",
  "AADSTS7000110": "Request is ambiguous, multiple application identifiers found.",
  "AADSTS7000112": "Application '{appIdentifier}'({appName}) is disabled.",
  "AADSTS7000113": "Application '{appIdentifier}' is not authorized to make application on-behalf-of calls.",
  "AADSTS7000114": "Application '{appIdentifier}' is not allowed to make application on-behalf-of calls.",
  "AADSTS7000115": "This grant is reedemable only by broker application.",
  "AADSTS7000116": "Client application '{appIdentifier}'({appName}) is disabled in tenant {tenant}. Please review the documentation: https://go.microsoft.com/fwlink/?linkid=2167553",
  "AADSTS7000117": "Resource application '{appIdentifier}'({appName}) is disabled in tenant {tenant}. Please review the documentation: https://go.microsoft.com/fwlink/?linkid=2167553",
  "AADSTS7000210": "Unable to find source of Trusted Certificate Authority policy.",
  "AADSTS7000211": "Trusted Certificate Authority policy is not configured on the tenant '{tenantId}'.",
  "AADSTS7000212": "No matching Trusted Certificate Authority policy found for authorized subject name.",
  "AADSTS7000213": "Invalid certificate chain.",
  "AADSTS7000214": "Certificate has been revoked.",
  "AADSTS7000215": "Invalid client secret provided. Ensure the secret being sent in the request is the client secret value, not the client secret ID, for a secret added to app '{identifier}'.",
  "AADSTS7000216": "'client_assertion', 'client_secret' or 'request' is required for the 'client_credentials' grant type.",
  "AADSTS7000217": "The service principal named {appPhrase} was not found in the tenant named {tenant_name}. This can happen if the application has not been installed by the administrator of the tenant.",
  "AADSTS7000218": "The request body must contain the following parameter: 'client_assertion' or 'client_secret'.",
  "AADSTS7000219": "'client_assertion' or 'client_secret' is required for the '{type}' grant type.",
  "AADSTS7000220": "Client application identifier in the provided grant doesn't match 'client_id' parameter.",
  "AADSTS7000221": "Certificate Subject must match Issuer claim in the client assertion.",
  "AADSTS7000222": "The provided client secret keys for app '{identifier}' are expired. Visit the Azure portal to create new keys for your app: https://aka.ms/NewClientSecret, or consider using certificate credentials for added security: https://aka.ms/certCreds.",
  "AADSTS7000223": "Application {brokerAppId} is not authorized to broker tokens.",
  "AADSTS7000224": "Application {childAppId} is not authorized to have tokens brokered on its behalf.",
  "AADSTS7000225": "Invalid credentials: An MSI certificate was included in the request for the app, but the app (object ID: {oid}, application id: {clientId}) is not an MSI. Ensure that your code is matching MSI identities and certificates appropriately.",
  "AADSTS7000226": "No federated identity credential policy found on application ({appid}). The client_assertion used to authenticate the request does not match the subject or application being requested.  Ensure that the application ID in the request is correct, that the app has a policy applied to it, and that the correct client_assertion is being provided in the request.",
  "AADSTS7000227": "No Federated Identity Credential policy found on application that matched the presented MSI-signed client assertion. Expecting a Federated Identity Credential with subject: '{msiSpid}', issuer: '{expectedIssuer}' and audience: '{expectedAudience}'.",
  "AADSTS7000228": "Application {brokerAppId} is not authorized to broker tokens.",
  "AADSTS7000229": "The client application {appId} is missing service principal in the tenant {tenantId}. See instructions here: https://go.microsoft.com/fwlink/?linkid=2225119",
  "AADSTS9001011": "Device policy contains unsupported required device state: {state}.",
  "AADSTS9002310": "Invalid request. The transforms element must contain at least one transform.",
  "AADSTS9002311": "Invalid request. Unsupported canonicalization algorithm.",
  "AADSTS9002312": "Invalid request. XML is empty.",
  "AADSTS9002313": "Invalid request. Request is malformed or invalid.",
  "AADSTS9002314": "Resource hostname is required.",
  "AADSTS9002315": "Invalid request. Cannot use /consumers/ on v1 signout.",
  "AADSTS9002316": "Invalid request. Cannot select consumer user session if the endpoint does not support consumer logout.",
  "AADSTS9002317": "Invalid issuer specified.",
  "AADSTS9002318": "Invalid request. Cannot select consumer user session and enterprise user session at the same time.",
  "AADSTS9002319": "Public clients can't send a client secret.",
  "AADSTS9002320": "The realm '{realm}' is not a configured realm of the tenant.",
  "AADSTS9002321": "No credentials found with the necessary validated claims that map to external user information.",
  "AADSTS9002322": "Protected forwarded token request is not in correct format.",
  "AADSTS9002323": "Certificate must be a valid base64 encoded certificate.",
  "AADSTS9002324": "Request should not contain more than one client credential parameters, this includes 'client_secret', 'client_assertion' and 'request' parameters.",
  "AADSTS9002325": "Proof Key for Code Exchange is required for cross-origin authorization code redemption.",
  "AADSTS9002326": "Cross-origin token redemption is permitted only for the 'Single-Page Application' client-type. Request origin: '{origin}'.",
  "AADSTS9002327": "Tokens issued for the 'Single-Page Application' client-type may only be redeemed via cross-origin requests.",
  "AADSTS9002328": "Invalid request. Cannot use /common or /consumers on admin-consent. Please specify the tenant in GUID or friendly name format OR generically reference it with /organizations.",
  "AADSTS9002329": "Misconfigured client or resource Service Principal '{appId}'. Missing Salt Key.",
  "AADSTS9002330": "Invalid Request. Wam_compat version is not supported.",
  "AADSTS9002331": "Application '{principalId}'({principalName}) is configured for use by Microsoft Account users only. Please use the /consumers endpoint to serve this request.",
  "AADSTS9002332": "Application '{principalId}'({principalName}) is configured for use by Azure Active Directory users only. Please do not use the /consumers endpoint to serve this request.",
  "AADSTS9002333": "Invalid request. The RDP request is missing the PoP key via req_cnf.",
  "AADSTS9002334": "Invalid request. The RDP logon request is missing the RDP assertion.",
  "AADSTS9002335": "Invalid request. The RDP assertion is invalid or is missing mandatory properties.",
  "AADSTS9002336": "Invalid RDP request.",
  "AADSTS9002337": "Invalid request. The application is registered in the legacy Microsoft Account tenant using apps.dev.microsoft.com, but is configured for use by Azure Active Directory tenants only. Use of /common is not supported for this registration. Please use a tenanted endpoint to request a token.",
  "AADSTS9002338": "Invalid request. Request is malformed or invalid.",
  "AADSTS9002339": "Unsupported user account for this endpoint. The user is a Microsoft Accounts user, but this app does not have the Microsoft account audience enabled. Either enable Microsoft account support to use the /common endpoint or use the tenanted endpoint to target a specific Azure AD tenant for auth.",
  "AADSTS9002340": "The permission (scope) list {scopeListString} is missing Rdp flow allowed permissions.",
  "AADSTS9002341": "User is required to permit SSO."
}